//promise, async await, event loop

//асинхронність / синхронність

// -> 1 -> 2 -> 3 -> 4 (це синхроність, наступна дія може початись тільки тоді, коли завершилась попередня)

//асинхронність (коли дії можна виконувати паралельно, не чекаючи завершення попередньої дії)

// 1 -> поставити чайник кип'ятитись))
//2 -> взяти чашку і поставити в неї пакетик)
//3 -> поцілувати дружину

//JS - однопоточна мова програмування, але щоб боротися з цим придумали Event Loop (цикл подій);

//Promise - це об'єкт

let res = '';

const prom = new Promise((resolve, reject)=> {
    const result = true;

    if(result) {
        res = 'Операція успішна'
        resolve("Операція успішна");
    } else {
        res = "Операція провалена"
        reject("Операція провалена");
    }
});

//const o = prom.then((value) => value); //promise без await завжди повертає promise, а не value;
//console.log(o);

console.log(res);