//ніколи не хардкодити date
//з date працювати тільки з інпутом, а не з календарем

//корисний метод keyboard і в нього є підметоди, які дозволяють по різному взаємодіяти
//клавіатурою та текстовими полями

//робота з радіо баттонами
//для Male та Female важливо ставити exact: true

//роюота з дропдаунами (Select)
//найбільш розповсюджений метод це selectOption

//для того щоб додати файл в тесті використовуємо метод .setInputFiles

//для того, щоб оновити в тесті сторіку додаємо метод "reload"

//використовуємо метод toPass, коли нам в будь-якому випадку необхідно дочекатись якосїсь дії

/* //метод .poll те саме, що і toPass, але  (Типові сценарії використання:

Очікування появи елемента після Ajax-запиту
Перевірка зміни тексту/атрибута елемента
Очікування завершення анімації
Перевірка зміни стану (наприклад, спінер зник)) */


//робота з поп-апами

