/*
Task 2
Привітання за часом
Залежно від часу доби, виведіть привітання: "Доброго ранку!", "Доброго дня!" або "Доброго вечора!".
Вхід: Година (наприклад, 15)
Вихід:
- Якщо год < 12: "Доброго ранку!"
- Якщо год 12–18: "Доброго дня!"
- Якщо год > 18: "Доброго вечора!"
*/

export function sayHiByHour(time: number) {
  if (isNaN(time) || typeof time !== "number") {
    return "Будь ласка, введи коректний час!";
  } else if (time < 0 || time > 23) {
    return "Будь ласка, введи час в діапазоні з 00:00 до 23:59!";
  } else if (time >= 0 && time < 12) {
    return "Доброго ранку!";
  } else if (time >= 12 && time <= 18) {
    return "Доброго дня!";
  } else if (time > 18 && time <= 23) {
    return "Доброго вечора!";
  }
}

sayHiByHour(15);
