/*
5. Порівняння чисел
Порівняйте два числа: виведіть більше, або повідомте, що числа рівні.
Вхід: Два числа (наприклад, 8 і 10)
Вихід:
- "Перше число більше."
- "Друге число більше."
- "Числа рівні."
*/

let a = 8
let b = 10

if (typeof a !== "number" || typeof b !== "number" || isNaN(a) || isNaN(b)) {
console.log ("Введіть числовий формат даних")
} else if (a > b) {
    console.log("Перше число більше");
} else if (b > a) {
    console.log("Друге число більше");
} else if (a === b) {
    console.log("Числа рівні")
}