/*
Task 2
Привітання за часом
Залежно від часу доби, виведіть привітання: "Доброго ранку!", "Доброго дня!" або "Доброго вечора!".
Вхід: Година (наприклад, 15)
Вихід:
- Якщо год < 12: "Доброго ранку!"
- Якщо год 12–18: "Доброго дня!"
- Якщо год > 18: "Доброго вечора!"
*/

const time = 15;

if (isNaN(time)) {
  console.log("Будь ласка, введи коректний час!");
} else if (time < 0 || time > 24) {
  console.log("Будь ласка, введи час в діапазоні з 00:00 до 24:00!");
} else if (time >= 0 && time < 12) {
  console.log("Доброго ранку!");
} else if (time >= 12 && time <= 18) {
  console.log("Доброго дня!");
} else if (time > 18 && time <= 24) {
  console.log("Доброго вечора!");
}
